In [2]:
import numpy as np
import pandas as pd

#Dataset dagli Open Data del Comune di Milano
# https://dati.comune.milano.it/dataset/ds685-rilevazione-ambientali-sulle-precipitazioni-2018
precip = pd.read_csv('../data/precipitazioni.csv', sep=";")
precip

       Tipo-Zone  Id Sensore          Data-Ora  Valore Cumulato
0          Brera       19373  01/01/2018 00:00              0.2
1         Juvara        5908  01/01/2018 00:00              0.0
2       Lambrate        2006  01/01/2018 00:00              0.0
3      Zavattari        9341  01/01/2018 00:00              0.4
4      Rosellini       14121  01/01/2018 00:00              0.0
...          ...         ...               ...              ...
43680      Brera       19373  31/12/2018 00:00              0.0
43681     Juvara        5908  31/12/2018 00:00              0.0
43682   Lambrate        2006  31/12/2018 00:00              0.0
43683  Zavattari        9341  31/12/2018 00:00              0.0
43684  Rosellini       14121  31/12/2018 00:00              0.0

[43685 rows x 4 columns]

Rinomino le colonne per avere nomi piu' corti e senza spazi

In [3]:
precip = precip.rename(columns={"Tipo-Zone":"zone","Id Sensore": "id", "Data-Ora": "data", "Valore Cumulato":"valore"})
precip

            zone     id              data  valore
0          Brera  19373  01/01/2018 00:00     0.2
1         Juvara   5908  01/01/2018 00:00     0.0
2       Lambrate   2006  01/01/2018 00:00     0.0
3      Zavattari   9341  01/01/2018 00:00     0.4
4      Rosellini  14121  01/01/2018 00:00     0.0
...          ...    ...               ...     ...
43680      Brera  19373  31/12/2018 00:00     0.0
43681     Juvara   5908  31/12/2018 00:00     0.0
43682   Lambrate   2006  31/12/2018 00:00     0.0
43683  Zavattari   9341  31/12/2018 00:00     0.0
43684  Rosellini  14121  31/12/2018 00:00     0.0

[43685 rows x 4 columns]

Creo una mask di valori booleani (True/False) rispetto alla condizione se un certo giorno è stato piovoso o no

In [4]:
pioggia = (precip.valore >0.0)

In [5]:
pioggia

0         True
1        False
2        False
3         True
4        False
         ...
43680    False
43681    False
43682    False
43683    False
43684    False
Name: valore, Length: 43685, dtype: bool

Calcolo alcune statistiche su tutti i giorni del dataset.
Domande: 
- Cosa vuol dire "Median precip on all days in 2018:    nan"?
- Perché la mediana restituisce nan e invece la media ha un valore (0.1022...)?

In [6]:
print("Average precip on all days in 2018:   ",
      np.mean(precip.valore))
print("Median precip on all days in 2018:   ",
      np.median(precip.valore))
print("Max precip on all days in 2018:   ",
      np.max(precip.valore))
print("Min precip on all days in 2018:   ",
      np.min(precip.valore))

Average precip on all days in 2018:    0.10222748155366658
Median precip on all days in 2018:    nan
Max precip on all days in 2018:    28.8
Min precip on all days in 2018:    0.0

Calcolo le stesse statistiche ma solo sui giorni di pioggia.
Domanda:
- Perché qui il calcolo della mediana ritorna 0.0 invece di nan come nel caso precedente?

In [7]:
print("Average precip on rainy days in 2018:   ",
      np.mean(precip.valore[pioggia]))
print("Median precip on rainy days in 2018:   ",
      np.median(precip.valore[pioggia]))
print("Max precip on rainy days in 2018:   ",
      np.max(precip.valore[pioggia]))
print("Min precip on rainy days in 2018:   ",
      np.min(precip.valore[pioggia]))

Average precip on rainy days in 2018:    1.2523592950539857
Median precip on rainy days in 2018:    0.6
Max precip on rainy days in 2018:    28.8
Min precip on rainy days in 2018:    0.2

Inizio a verificare che ci siano dei nan nella colonna valore di precip (lo sapevo già, ma lo verifico)

In [8]:
precip.valore.isnull().values.any()

True

Cerco tutte le righe del dataframe precip che contengono un nan
Domanda:
- dove dico che cerco rispetto alle righe e non alle colonne?

In [10]:
df1 = precip[precip.isna().any(axis=1)]
print (df1)

            zone    id              data  valore
43     Zavattari  9341  01/01/2018 08:00     NaN
153    Zavattari  9341  02/01/2018 06:00     NaN
248    Zavattari  9341  03/01/2018 01:00     NaN
368    Zavattari  9341  04/01/2018 01:00     NaN
488    Zavattari  9341  05/01/2018 01:00     NaN
...          ...   ...               ...     ...
42966     Juvara  5908  25/12/2018 01:00     NaN
42971     Juvara  5908  25/12/2018 02:00     NaN
42976     Juvara  5908  25/12/2018 03:00     NaN
42981     Juvara  5908  25/12/2018 04:00     NaN
42986     Juvara  5908  25/12/2018 05:00     NaN

[587 rows x 4 columns]

In [13]:
precip.isna().all(axis=1)[43]

False

Rimuovo da df1 le righe che hanno nan nella colonna valore.
Quindi ora ho due dataframe:
- precip che contiene anche i nan
- df1 che non contiene i nan

In [30]:
df1 = precip.dropna(subset=['valore'])
print(df1)

            zone     id              data  valore
0          Brera  19373  01/01/2018 00:00     0.2
1         Juvara   5908  01/01/2018 00:00     0.0
2       Lambrate   2006  01/01/2018 00:00     0.0
3      Zavattari   9341  01/01/2018 00:00     0.4
4      Rosellini  14121  01/01/2018 00:00     0.0
...          ...    ...               ...     ...
43680      Brera  19373  31/12/2018 00:00     0.0
43681     Juvara   5908  31/12/2018 00:00     0.0
43682   Lambrate   2006  31/12/2018 00:00     0.0
43683  Zavattari   9341  31/12/2018 00:00     0.0
43684  Rosellini  14121  31/12/2018 00:00     0.0

[43098 rows x 4 columns]

Provo a calcolare la mediana di valore su df1 e ora il risultato è 0.0

In [31]:
print("Median precip on all days in 2018:   ",
      np.median(df1.valore))

Median precip on all days in 2018:    0.0

Ora voglio contare i valori. Uso groupby (simile alla funzione groupby vista in R, dove però si usava groupby in combinazione a summarize), specificando qual è la colonna i cui valori voglio vengano raggruppati.

In [37]:
df1.groupby(valori).count()

         zone     id   data
valore
0.0     39580  39580  39580
0.2      1075   1075   1075
0.4       480    480    480
0.6       326    326    326
0.8       291    291    291
...       ...    ...    ...
18.4        1      1      1
20.6        1      1      1
24.0        1      1      1
26.2        1      1      1
28.8        1      1      1

[65 rows x 3 columns]

Faccio lo stesso ma questa volta con il dataframe precip.
I valori sono gli stessi, ma sappiamo che in precip ci sono anche dei nan.
Quindi: con groupby e count non vedo anche i nan.
Per quelli occorre una funzione apposita.

In [36]:
precip.groupby(valori).count()

         zone     id   data  valore
valore
0.0     39580  39580  39580   39580
0.2      1075   1075   1075    1075
0.4       480    480    480     480
0.6       326    326    326     326
0.8       291    291    291     291
...       ...    ...    ...     ...
18.4        1      1      1       1
20.6        1      1      1       1
24.0        1      1      1       1
26.2        1      1      1       1
28.8        1      1      1       1

[65 rows x 4 columns]

Qui conto i nan della colonna valore del data frame precip, combinando la funzione isnull() con sum()

In [38]:
precip.valore.isnull().sum()

587